andyelsen85-bit/Range-Master/artifacts/firmware/sdkconfig.defaults
# ── Target ────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"

# ── Chip revision — Guition JC8012P4A1C uses ESP32-P4 rev v1.3 (ECO2) ───
# REQUIRED: use IDF 5.3.x ONLY.
#   IDF 5.4.2+: hangs in esp_lcd_new_dsi_bus() on ECO2 D-PHY (IDF issue #17778)
#   IDF 5.5.x+: refuses ECO2 entirely (requires v3.1+)
# CONFIG_ESP32P4_REV_MIN_FULL=100 tells the bootloader to accept v1.0+ chips.
CONFIG_ESP32P4_REV_MIN_FULL=100

# ── Flash (JC8012P4A1C has 16 MB flash) ───────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ── PSRAM ─────────────────────────────────────────────────────────────────
# ESP32-P4 uses HEX PSRAM (AP Memory X16) — requires MODE_HEX, not MODE_OCT.
# Without CONFIG_SPIRAM_MODE_HEX=y the speed choice has no valid mode to attach
# to and is silently ignored, leaving PSRAM stuck at the 20 MHz default.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# Only two speeds exist for ESP32-P4 hex PSRAM in IDF 5.3.5: 20M (default) and 200M.
# 200M requires IDF_EXPERIMENTAL_FEATURES. The AP Memory chip is rated for 200M;
# "experimental" means Espressif hadn't finished full validation — hardware is capable.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
# SPIRAM_USE_MALLOC integrates PSRAM into the C-library heap so plain
# malloc()/free() can draw from PSRAM when internal SRAM is low.
# (CAPS_ALLOC only exposes PSRAM via heap_caps_malloc — plain malloc()
# would stay in internal DRAM, exhausting it as LVGL allocates widgets.)
CONFIG_SPIRAM_USE_MALLOC=y
# Allocations <= 512 B prefer internal SRAM (fast); anything larger
# falls to PSRAM.  Keeps small structs/pointers in fast RAM while
# large LVGL buffers and widget trees land in the 32 MB PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512

# ── MIPI DSI ──────────────────────────────────────────────────────────────
CONFIG_LCD_ENABLE_DEBUG_LOG=n

# ── Power management — REQUIRED for MIPI DSI on ESP32-P4 IDF 5.3.x ───────
# Without CONFIG_PM_ENABLE, esp_perip_clk_init() is a no-op stub (warning:
# "has not been implemented yet"). The MIPI DSI D-PHY PLL reference clock
# (MIPI_DSI_DPHY_PLL_REFCLK_EN) is never enabled, so esp_lcd_new_dsi_bus()
# hangs forever waiting for PLL lock. PM_ENABLE triggers the full clock-init
# path and opens those gates before our display init runs.
CONFIG_PM_ENABLE=y
# Keep tickless idle off — our LVGL loop always has work to do and we don't
# want the scheduler sleeping under the display task.
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# ── FreeRTOS ──────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ── HTTP client ───────────────────────────────────────────────────────────
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ── NVS ───────────────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── ESP-Hosted SDIO (P4 host ↔ C6 slave) ────────────────────────────────
# espressif/esp_hosted ≥2.4.2 + espressif/esp_wifi_remote ≥1.0.0
# C6 must run ESP-Hosted-MCU slave firmware (SDIO mode, not AT firmware).
# Pins confirmed from profi-max/JC8012P4A1_BSP_ESP32P4 BSP documentation.
# If symbols differ after `idf.py menuconfig`, adjust here to match.
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
# Use SDIO host interface (not SPI/UART)
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
# Target slave chip
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
# SDIO GPIO matrix — required on ESP32-P4 for non-slot-default pins
CONFIG_SDMMC_USE_GPIO_MATRIX=y
# SDIO pin assignments — confirmed from profi-max/JC8012P4A1_BSP_ESP32P4
# SD2_CLK=GPIO18, SD2_CMD=GPIO19, SD2_D0-D3=GPIO14-17
# NOTE: exact Kconfig symbol names must be verified after first idf.py build:
#   grep -r "SDIO.*GPIO\|GPIO.*SDIO" managed_components/espressif__esp_hosted/
# Update these names if the build rejects them.
CONFIG_ESP_HOSTED_SDIO_CLK_GPIO=18
CONFIG_ESP_HOSTED_SDIO_CMD_GPIO=19
CONFIG_ESP_HOSTED_SDIO_D0_GPIO=14
CONFIG_ESP_HOSTED_SDIO_D1_GPIO=15
CONFIG_ESP_HOSTED_SDIO_D2_GPIO=16
CONFIG_ESP_HOSTED_SDIO_D3_GPIO=17
# C6 reset (CHIP_PU → GPIO54) and wakeup (IO2 → GPIO6)
CONFIG_ESP_HOSTED_RESET_GPIO=54
CONFIG_ESP_HOSTED_WAKEUP_GPIO=6
# SDIO clock — start at 20 MHz (conservative); raise to 40 MHz if stable
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=20000

# ── UART ──────────────────────────────────────────────────────────────────
CONFIG_UART_ISR_IN_IRAM=y

# ── Log level ─────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Partition table ───────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ── Stack sizes ───────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# ── Unused wireless stacks — disable to recover ~80 KB of DRAM BSS ───────
# Bluetooth and OpenThread are not used in this project. Leaving them at
# IDF defaults bloats BSS so far that --enable-non-contiguous-regions
# discards sections that cannot fit in internal DRAM.
CONFIG_BT_ENABLED=n
CONFIG_OPENTHREAD_ENABLED=n
CONFIG_IEEE802154_ENABLED=n

# ── lwip / mbedtls DRAM reduction ─────────────────────────────────────────
# IPv6 neighbor-discovery tables (nd6.c) are a major cause of sram_low
# overflow under --enable-non-contiguous-regions on IDF 5.3.x / ESP32-P4.
# This terminal only needs IPv4.
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_MAX_SOCKETS=4
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y

# ── LVGL memory: use system malloc instead of a static internal pool ──────
# lv_mem_core_builtin.c declares `static uint8_t work_mem_int[LV_MEM_SIZE]`
# in BSS — 64 KB by default (CONFIG_LV_MEM_SIZE_KILOBYTES=64). That single
# array fills all contiguous internal SRAM and causes the
# --enable-non-contiguous-regions linker error on ESP32-P4 / IDF 5.3.x.
#
# CONFIG_LV_USE_CLIB_MALLOC=y selects the "Standard C functions malloc/realloc/free"
# choice (Kconfig line 51-52 in managed_components/lvgl__lvgl/Kconfig).
# LV_MEM_SIZE_KILOBYTES only applies when LV_USE_BUILTIN_MALLOC is selected
# (Kconfig line 98: depends on LV_USE_BUILTIN_MALLOC), so switching to CLIB
# drops work_mem_int from BSS entirely. At runtime lv_malloc() calls the
# system malloc() which draws from PSRAM via SPIRAM_USE_MALLOC above.
CONFIG_LV_USE_CLIB_MALLOC=y

# ── LVGL Montserrat fonts (all sizes used by the UI screens) ──
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y

